In [1]:
import numpy as np
import pandas as pd

In [3]:
label=[1,0,1,0,1]
data = pd.Series(data=label,index=['a','b','c','d','e'],dtype=int,name="label")
print (data)

a    1
b    0
c    1
d    0
e    1
Name: label, dtype: int32

In [4]:
data['a']

1

In [6]:
data[['a','b']]

a    1
b    0
Name: label, dtype: int32

In [7]:
frame = pd.DataFrame({'name':['Time','Jack','Lily'],'age':['18','20','24'],'weight':['56.7','64.0','50.0']})

In [8]:
print(frame)

   name age weight
0  Time  18   56.7
1  Jack  20   64.0
2  Lily  24   50.0

In [9]:
frame1 = pd.DataFrame(frame,columns=["name","weight"])
print(frame1)
print(frame)

   name weight
0  Time   56.7
1  Jack   64.0
2  Lily   50.0
   name age weight
0  Time  18   56.7
1  Jack  20   64.0
2  Lily  24   50.0

In [10]:
frame1["friends_num"]=[10,12,14]
print(frame1)

   name weight  friends_num
0  Time   56.7           10
1  Jack   64.0           12
2  Lily   50.0           14

In [11]:
frame2 = frame1.drop(["name"],axis=1)
print(frame2)

  weight  friends_num
0   56.7           10
1   64.0           12
2   50.0           14

In [12]:
frame1[frame1["friends_num"]>10]

   name weight  friends_num
1  Jack   64.0           12
2  Lily   50.0           14

In [16]:
print(frame)

   name age weight
0  Time  18   56.7
1  Jack  20   64.0
2  Lily  24   50.0

In [22]:
frame.describe(include=['O'])

        name age weight
count      3   3      3
unique     3   3      3
top     Lily  24   64.0
freq       1   1      1

In [23]:
frame1.fillna(0)

   name weight  friends_num
0  Time   56.7           10
1  Jack   64.0           12
2  Lily   50.0           14

In [24]:
frame1.dropna()

   name weight  friends_num
0  Time   56.7           10
1  Jack   64.0           12
2  Lily   50.0           14

In [25]:
frame1.dropna(how="all")

   name weight  friends_num
0  Time   56.7           10
1  Jack   64.0           12
2  Lily   50.0           14

In [26]:
data = pd.DataFrame(pd.read_csv('train.csv'))

In [27]:
data_test = pd.DataFrame(pd.read_csv('test.csv'))

In [29]:
print(data)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
5              6         0       3
6              7         0       1
7              8         0       3
8              9         1       3
9             10         1       2
10            11         1       3
11            12         1       1
12            13         0       3
13            14         0       3
14            15         0       3
15            16         1       2
16            17         0       3
17            18         1       2
18            19         0       3
19            20         1       3
20            21         0       2
21            22         1       2
22            23         1       3
23            24         1       1
24            25         0       3
25            26         1       3
26            27         0       3
27            28         0       1
28            29         1       3
29            30         0       3
..           ...       ...     ...
861          862         0       2
862          863         1       1
863          864         0       3
864          865         0       2
865          866         1       2
866          867         1       2
867          868         0       1
868          869         0       3
869          870         1       3
870          871         0       3
871          872         1       1
872          873         0       1
873          874         0       3
874          875         1       2
875          876         1       3
876          877         0       3
877          878         0       3
878          879         0       3
879          880         1       1
880          881         1       2
881          882         0       3
882          883         0       3
883          884         0       2
884          885         0       3
885          886         0       3
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
5                                     Moran, Mr. James    male   NaN      0
6                              McCarthy, Mr. Timothy J    male  54.0      0
7                       Palsson, Master. Gosta Leonard    male   2.0      3
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
10                     Sandstrom, Miss. Marguerite Rut  female   4.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
12                      Saundercock, Mr. William Henry    male  20.0      0
13                         Andersson, Mr. Anders Johan    male  39.0      1
14                Vestrom, Miss. Hulda Amanda Adolfina  female  14.0      0
15                    Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0
16                                Rice, Master. Eugene    male   2.0      4
17                        Williams, Mr. Charles Eugene    male   NaN      0
18   Vander Planke, Mrs. Julius (Emelia Maria Vande...  female  31.0      1
19                             Masselmani, Mrs. Fatima  female   NaN      0
20                                Fynney, Mr. Joseph J    male  35.0      0
21                               Beesley, Mr. Lawrence    male  34.0      0
22                         McGowan, Miss. Anna "Annie"  female  15.0      0
23                        Sloper, Mr. William Thompson    male  28.0      0
24                       Palsson, Miss. Torborg Danira  female   8.0      3
25   Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...  female  38.0      1
26                             Emir, Mr. Farred Chehab    male   NaN      0
27                      Fortune, Mr. Charles Alexander    male  19.0      3
28                       O'Dwyer, Miss. Ellen "Nellie"  female   NaN      0
29                                 Todoroff, Mr. Lalio    male   NaN      0
..                                                 ...     ...   ...    ...
861                        Giles, Mr. Frederick Edward    male  21.0      1
862  Swift, Mrs. Frederick Joel (Margaret Welles Ba...  female  48.0      0
863                  Sage, Miss. Dorothy Edith "Dolly"  female   NaN      8
864                             Gill, Mr. John William    male  24.0      0
865                           Bystrom, Mrs. (Karolina)  female  42.0      0
866                       Duran y More, Miss. Asuncion  female  27.0      1
867               Roebling, Mr. Washington Augustus II    male  31.0      0
868                        van Melkebeke, Mr. Philemon    male   NaN      0
869                    Johnson, Master. Harold Theodor    male   4.0      1
870                                  Balkic, Mr. Cerin    male  26.0      0
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
872                           Carlsson, Mr. Frans Olof    male  33.0      0
873                        Vander Cruyssen, Mr. Victor    male  47.0      0
874              Abelson, Mrs. Samuel (Hannah Wizosky)  female  28.0      1
875                   Najib, Miss. Adele Kiamie "Jane"  female  15.0      0
876                      Gustafsson, Mr. Alfred Ossian    male  20.0      0
877                               Petroff, Mr. Nedelio    male  19.0      0
878                                 Laleff, Mr. Kristo    male   NaN      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
881                                 Markun, Mr. Johann    male  33.0      0
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
883                      Banfield, Mr. Frederick James    male  28.0      0
884                             Sutehall, Mr. Henry Jr    male  25.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket      Fare        Cabin Embarked
0        0         A/5 21171    7.2500          NaN        S
1        0          PC 17599   71.2833          C85        C
2        0  STON/O2. 3101282    7.9250          NaN        S
3        0            113803   53.1000         C123        S
4        0            373450    8.0500          NaN        S
5        0            330877    8.4583          NaN        Q
6        0             17463   51.8625          E46        S
7        1            349909   21.0750          NaN        S
8        2            347742   11.1333          NaN        S
9        0            237736   30.0708          NaN        C
10       1           PP 9549   16.7000           G6        S
11       0            113783   26.5500         C103        S
12       0         A/5. 2151    8.0500          NaN        S
13       5            347082   31.2750          NaN        S
14       0            350406    7.8542          NaN        S
15       0            248706   16.0000          NaN        S
16       1            382652   29.1250          NaN        Q
17       0            244373   13.0000          NaN        S
18       0            345763   18.0000          NaN        S
19       0              2649    7.2250          NaN        C
20       0            239865   26.0000          NaN        S
21       0            248698   13.0000          D56        S
22       0            330923    8.0292          NaN        Q
23       0            113788   35.5000           A6        S
24       1            349909   21.0750          NaN        S
25       5            347077   31.3875          NaN        S
26       0              2631    7.2250          NaN        C
27       2             19950  263.0000  C23 C25 C27        S
28       0            330959    7.8792          NaN        Q
29       0            349216    7.8958          NaN        S
..     ...               ...       ...          ...      ...
861      0             28134   11.5000          NaN        S
862      0             17466   25.9292          D17        S
863      2          CA. 2343   69.5500          NaN        S
864      0            233866   13.0000          NaN        S
865      0            236852   13.0000          NaN        S
866      0     SC/PARIS 2149   13.8583          NaN        C
867      0          PC 17590   50.4958          A24        S
868      0            345777    9.5000          NaN        S
869      1            347742   11.1333          NaN        S
870      0            349248    7.8958          NaN        S
871      1             11751   52.5542          D35        S
872      0               695    5.0000  B51 B53 B55        S
873      0            345765    9.0000          NaN        S
874      0         P/PP 3381   24.0000          NaN        C
875      0              2667    7.2250          NaN        C
876      0              7534    9.8458          NaN        S
877      0            349212    7.8958          NaN        S
878      0            349217    7.8958          NaN        S
879      1             11767   83.1583          C50        C
880      1            230433   26.0000          NaN        S
881      0            349257    7.8958          NaN        S
882      0              7552   10.5167          NaN        S
883      0  C.A./SOTON 34068   10.5000          NaN        S
884      0   SOTON/OQ 392076    7.0500          NaN        S
885      5            382652   29.1250          NaN        Q
886      0            211536   13.0000          NaN        S
887      0            112053   30.0000          B42        S
888      2        W./C. 6607   23.4500          NaN        S
889      0            111369   30.0000         C148        C
890      0            370376    7.7500          NaN        Q

[891 rows x 12 columns]

In [30]:
data_test = data_test[["Pclass","Name","Sex","Age","SibSp","Parch","Ticket","Fare","Cabin","Embarked"]]

In [31]:
print(data_test)

     Pclass                                               Name     Sex   Age  \
0         3                                   Kelly, Mr. James    male  34.5
1         3                   Wilkes, Mrs. James (Ellen Needs)  female  47.0
2         2                          Myles, Mr. Thomas Francis    male  62.0
3         3                                   Wirz, Mr. Albert    male  27.0
4         3       Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0
5         3                         Svensson, Mr. Johan Cervin    male  14.0
6         3                               Connolly, Miss. Kate  female  30.0
7         2                       Caldwell, Mr. Albert Francis    male  26.0
8         3          Abrahim, Mrs. Joseph (Sophie Halaut Easu)  female  18.0
9         3                            Davies, Mr. John Samuel    male  21.0
10        3                                   Ilieff, Mr. Ylio    male   NaN
11        1                         Jones, Mr. Charles Cresson    male  46.0
12        1      Snyder, Mrs. John Pillsbury (Nelle Stevenson)  female  23.0
13        2                               Howard, Mr. Benjamin    male  63.0
14        1  Chaffee, Mrs. Herbert Fuller (Carrie Constance...  female  47.0
15        2      del Carlo, Mrs. Sebastiano (Argenia Genovesi)  female  24.0
16        2                                  Keane, Mr. Daniel    male  35.0
17        3                                  Assaf, Mr. Gerios    male  21.0
18        3                       Ilmakangas, Miss. Ida Livija  female  27.0
19        3              Assaf Khalil, Mrs. Mariana (Miriam")"  female  45.0
20        1                             Rothschild, Mr. Martin    male  55.0
21        3                          Olsen, Master. Artur Karl    male   9.0
22        1               Flegenheim, Mrs. Alfred (Antoinette)  female   NaN
23        1                    Williams, Mr. Richard Norris II    male  21.0
24        1    Ryerson, Mrs. Arthur Larned (Emily Maria Borie)  female  48.0
25        3                            Robins, Mr. Alexander A    male  50.0
26        1                       Ostby, Miss. Helene Ragnhild  female  22.0
27        3                                  Daher, Mr. Shedid    male  22.5
28        1                            Brady, Mr. John Bertram    male  41.0
29        3                                  Samaan, Mr. Elias    male   NaN
..      ...                                                ...     ...   ...
388       3                               Canavan, Mr. Patrick    male  21.0
389       3                        Palsson, Master. Paul Folke    male   6.0
390       1                         Payne, Mr. Vivian Ponsonby    male  23.0
391       1     Lines, Mrs. Ernest H (Elizabeth Lindsey James)  female  51.0
392       3                      Abbott, Master. Eugene Joseph    male  13.0
393       2                               Gilbert, Mr. William    male  47.0
394       3                           Kink-Heilmann, Mr. Anton    male  29.0
395       1     Smith, Mrs. Lucien Philip (Mary Eloise Hughes)  female  18.0
396       3                               Colbert, Mr. Patrick    male  24.0
397       1  Frolicher-Stehli, Mrs. Maxmillian (Margaretha ...  female  48.0
398       3                     Larsson-Rondberg, Mr. Edvard A    male  22.0
399       3                           Conlon, Mr. Thomas Henry    male  31.0
400       1                            Bonnell, Miss. Caroline  female  30.0
401       2                                    Gale, Mr. Harry    male  38.0
402       1                     Gibson, Miss. Dorothy Winifred  female  22.0
403       1                             Carrau, Mr. Jose Pedro    male  17.0
404       1                       Frauenthal, Mr. Isaac Gerald    male  43.0
405       2       Nourney, Mr. Alfred (Baron von Drachstedt")"    male  20.0
406       2                          Ware, Mr. William Jeffery    male  23.0
407       1                         Widener, Mr. George Dunton    male  50.0
408       3                    Riordan, Miss. Johanna Hannah""  female   NaN
409       3                          Peacock, Miss. Treasteall  female   3.0
410       3                             Naughton, Miss. Hannah  female   NaN
411       1    Minahan, Mrs. William Edward (Lillian E Thorpe)  female  37.0
412       3                     Henriksson, Miss. Jenny Lovisa  female  28.0
413       3                                 Spector, Mr. Woolf    male   NaN
414       1                       Oliva y Ocana, Dona. Fermina  female  39.0
415       3                       Saether, Mr. Simon Sivertsen    male  38.5
416       3                                Ware, Mr. Frederick    male   NaN
417       3                           Peter, Master. Michael J    male   NaN

     SibSp  Parch              Ticket      Fare            Cabin Embarked
0        0      0              330911    7.8292              NaN        Q
1        1      0              363272    7.0000              NaN        S
2        0      0              240276    9.6875              NaN        Q
3        0      0              315154    8.6625              NaN        S
4        1      1             3101298   12.2875              NaN        S
5        0      0                7538    9.2250              NaN        S
6        0      0              330972    7.6292              NaN        Q
7        1      1              248738   29.0000              NaN        S
8        0      0                2657    7.2292              NaN        C
9        2      0           A/4 48871   24.1500              NaN        S
10       0      0              349220    7.8958              NaN        S
11       0      0                 694   26.0000              NaN        S
12       1      0               21228   82.2667              B45        S
13       1      0               24065   26.0000              NaN        S
14       1      0         W.E.P. 5734   61.1750              E31        S
15       1      0       SC/PARIS 2167   27.7208              NaN        C
16       0      0              233734   12.3500              NaN        Q
17       0      0                2692    7.2250              NaN        C
18       1      0    STON/O2. 3101270    7.9250              NaN        S
19       0      0                2696    7.2250              NaN        C
20       1      0            PC 17603   59.4000              NaN        C
21       0      1             C 17368    3.1708              NaN        S
22       0      0            PC 17598   31.6833              NaN        S
23       0      1            PC 17597   61.3792              NaN        C
24       1      3            PC 17608  262.3750  B57 B59 B63 B66        C
25       1      0           A/5. 3337   14.5000              NaN        S
26       0      1              113509   61.9792              B36        C
27       0      0                2698    7.2250              NaN        C
28       0      0              113054   30.5000              A21        S
29       2      0                2662   21.6792              NaN        C
..     ...    ...                 ...       ...              ...      ...
388      0      0              364858    7.7500              NaN        Q
389      3      1              349909   21.0750              NaN        S
390      0      0               12749   93.5000              B24        S
391      0      1            PC 17592   39.4000              D28        S
392      0      2           C.A. 2673   20.2500              NaN        S
393      0      0          C.A. 30769   10.5000              NaN        S
394      3      1              315153   22.0250              NaN        S
395      1      0               13695   60.0000              C31        S
396      0      0              371109    7.2500              NaN        Q
397      1      1               13567   79.2000              B41        C
398      0      0              347065    7.7750              NaN        S
399      0      0               21332    7.7333              NaN        Q
400      0      0               36928  164.8667               C7        S
401      1      0               28664   21.0000              NaN        S
402      0      1              112378   59.4000              NaN        C
403      0      0              113059   47.1000              NaN        S
404      1      0               17765   27.7208              D40        C
405      0      0       SC/PARIS 2166   13.8625              D38        C
406      1      0               28666   10.5000              NaN        S
407      1      1              113503  211.5000              C80        C
408      0      0              334915    7.7208              NaN        Q
409      1      1  SOTON/O.Q. 3101315   13.7750              NaN        S
410      0      0              365237    7.7500              NaN        Q
411      1      0               19928   90.0000              C78        Q
412      0      0              347086    7.7750              NaN        S
413      0      0           A.5. 3236    8.0500              NaN        S
414      0      0            PC 17758  108.9000             C105        C
415      0      0  SOTON/O.Q. 3101262    7.2500              NaN        S
416      0      0              359309    8.0500              NaN        S
417      1      1                2668   22.3583              NaN        C

[418 rows x 10 columns]

In [32]:
x = data[["Pclass","Name","Sex","Age","SibSp","Parch","Ticket","Fare","Cabin","Embarked"]]
y = data[["Survived"]]

In [34]:
x.describe()

           Pclass         Age       SibSp       Parch        Fare
count  891.000000  714.000000  891.000000  891.000000  891.000000
mean     2.308642   29.699118    0.523008    0.381594   32.204208
std      0.836071   14.526497    1.102743    0.806057   49.693429
min      1.000000    0.420000    0.000000    0.000000    0.000000
25%      2.000000   20.125000    0.000000    0.000000    7.910400
50%      3.000000   28.000000    0.000000    0.000000   14.454200
75%      3.000000   38.000000    1.000000    0.000000   31.000000
max      3.000000   80.000000    8.000000    6.000000  512.329200

In [35]:
x.describe(include=['O'])

,Name,Sex,Ticket,Cabin,Embarked
count,891,891,891,204,889
unique,891,2,681,147,3
top,"Birkeland, Mr. Hans Martin Monsen",male,CA. 2343,C23 C25 C27,S
freq,1,577,7,4,644

In [4]:
x.describe()

NameError: name 'x' is not defined